<template>
  <div class="info">
    <b-container class="main-title mb-4 justify-content-start">Доставка и оплата</b-container>
    <b-container
      @click="isVisible = true"
      :class="{'info--isActive': isVisible }"
      class="text-left flex-column justify-content-start align-items-start info__description mb-5">
      <p class="font-weight-bold">Суши и роллы с доставкой</p>
      <p>Самым известным и без сомнения значимым достижением кулинарной мысли японских поваров стали суши.
        Сегодня это блюдо получило огромную популярность не только в Европе, но и в России. И неудивительно,
        ведь тонкий и неповторимый вкус суши сведет с ума любого ценителя изысканной пищи.</p>

      <p class="font-weight-bold">4 причины заказать суши у нас</p>
      <span>Приведем несколько доводов, почему заказывать суши и роллы в Краснодаре, лучше именно у нас:</span>
      <ul>
        <li>Более 120 различных позиций в ассортименте нашего меню, так что каждый найдёт варианты для себя.</li>
        <li>Оригинальные рецепты блюд - аналогов вы не найдете в других японских ресторанах.</li>
        <li>Мы используем только свежие продукты, от проверенных поставщиков, в приготовлении суши и роллов.</li>
        <li>Различные акции и скидки, подробности о которых вы можете прочитать в слайдере.</li>
        <li>Приятные цены на сеты, благодаря которым вы можете купить суши очень выгодно.</li>
        <li>А если этих доводов недостаточно, то остаётся только купить наши блюда и убедится в их отличном качестве самостоятельно.</li>
        <li>И это будет дешево и (нет, не сердито) вкусно.</li>
      </ul>

      <p class="font-weight-bold">Ресторан японской кухни в кармане</p>
      <p>Заядлые любители комфорта, современных технологий и суши могут воспользоваться нашим приложением для мобильных
        устройств на базе Android и iOS. Программа позволит выбрать и выгодно заказать роллы из нашего обширного прайс-листа,
        отслеживать историю заказов и ознакомиться со свежими отзывами пользователей.</p>

      <p>К тому же оно запомнит вашу локацию и отобразит актуальные данные по стоимости и времени доставки.
        И вишенкой на торте – специальные акции и предложения для пользователей приложением, ознакомиться с которыми можно в специальном разделе меню.
        А ещё из приложения можно быстро связаться с нашими операторами для уточнения всех интересующих вопросов.</p>

      <p class="font-weight-bold">Что нужно знать об оплате и доставке</p>
      <p>Заставлять клиентов ждать – не наш выбор. Поэтому все заказы доставляются в течение максимум 90 минут в пределах
        рабочего времени (с 9:00 до 22:00, заявки принимаются до 21:30).</p>

      <p> Минимальная сумма заказа составляет 600 рублей. С оплатой проблем также не возникнет, потому что у нас низкие цены,
        а расчёт производится по прибытии заказа на месте при помощи наличных или банковской карты. Так что заказывайте наши блюда и,
        как говорят в Японии, итадакимас вам!</p>

      <p class="font-weight-bold">История суши</p>
      <p>Интересно, что первоначально японцы не ели рыбу и рис вместе. Появление суши – всего лишь результат пищевого эксперимента.
        В Японии, кстати, этот продукт называют не иначе как «сюси», что в переводе с китайского значит «маринованная рыба».
        Дело в том, что рис изначально использовали исключительно для увеличения срока хранения маринованной рыбы.</p>

      <p class="font-weight-bold">Разновидности суши</p>
      <p>Основное достоинство суши в том, что среди большого количества их разновидностей любой может найти себе блюдо по душе.
        Для истинных ценителей японской простоты и гармонии подойдут нигири суши, представляющие сформированный особым образом брусок риса,
        покрытый ломтиком свежей рыбы, омлета или другого морепродукта. Любители пикантных блюд оценят спайс суши (гунканы).</p>

      <p>Практически каждому приглянутся роллы – классическая японская закуска. Роллы по сути являются рулетом,
        обрамленным нори и наполненным рисом, овощами и морепродуктами. Эта закуска больше всего подверглась влиянию различных культур.
        Появились калифорнийские роллы, роллы «Филадельфия», полюбившиеся американцам. Сегодня можно встретить и вовсе далекие от японских
        канонов начинки: фрукты, омлеты. Ну и последняя разновидность суши – это сашими. Ровные ломтики разных видов свежей рыбы и морепродуктов,
        красиво украшенные нарезкой из овощей, не оставят равнодушными приверженцев изящества и лаконичности в пище.</p>

      <p>Суши – не просто традиционный представитель японской кухни. Именно в этом блюде воплотилась одна из важнейших японских ценностей:
        красота в простоте. Изумительные суши всегда станут гармоничным дополнением к здоровой и вкусной пище.</p>
    </b-container>
  </div>
</template>

<script>
export default {
  name: "Info",
  data(){
    return{
      isVisible: false
    }
  }
}
</script>

<style lang="scss" scoped>
.info{
  &__description{
    font-size: .75rem;
    font-weight: 300;
    height: 250px;
    position: relative;
    overflow: hidden;
    top: 0;

    &::before{
      content: '';
      position: absolute;
      bottom: 0;
      width: 100%;
      height: 100px;
      background-image: linear-gradient(rgba(255, 255, 255, 0) 0%, #fff 100%);
    }
  }

  &--isActive{
    height: auto;
    overflow: visible;

    &::before{
      display: none;
    }
  }
}
</style>
