<template>
  <div class="main container d-block text-left about">
    <h2 class="about__title mb-3">О нас</h2>
    <div class="about__content">
      <div class="mb-3">
        Что же значит пицца для каждого из нас и какой она должна быть?
        Большинство из нас ответит, что вкусной, сытной, приготовленной быстро
        и из качественных продуктов. Всё верно, мы тоже так думаем! Но если копнуть
        чуть глубже и вспомнить, что мы чувствуем, когда с аппетитом откусываем горячий
        кусочек пиццы – это же счастье, друзья! Пицца рождает это приятное чувство внутри
        нас, и оно растекается теплом по всему телу. Мы очень хотим, чтобы вы все были счастливы!
        Приходите в PizzBurg - счастье близко!
      </div>
      <div>
        PizzBurg – это понятная кухня, сочетающая современные
        русские, европейские, азиатские направления и доступные цены.
        Пицца PizzBurg – это воздушное тесто с хрустящей корочкой,
        пышной начинкой из натуральных ингредиентов и великолепным вкусом!
        «Как для себя» – простая и понятная концепция, которая лежит в основе
        нашего проекта. Мы работаем и относимся к нашим гостям так, как хотели бы,
        чтоб относились к нам. Мы действительно уверены, что вам у нас очень понравится!
      </div>

    </div>
  </div>
</template>

<script>
export default {

}
</script>

<style lang='scss' scoped>
.main{
  min-height: 100vh;
}

.about{
  &__content{
    font-weight: 300;

    span{
      font-weight: 600;
    }
  }
}
</style>
